app/views/articles/index.html.erb

  <h4><%= article.author.name %></h4>
  <% article.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "relate_categories" ON "categories"."id" = "relate_categories"."category_id" WHERE "relate_categories"."article_id" = ?  [["article_id", 17]]