app/views/articles/show.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 10]]
SELECT "categories".* FROM "categories" INNER JOIN "relate_categories" ON "categories"."id" = "relate_categories"."category_id" WHERE "relate_categories"."article_id" = ?  [["article_id", 10]]
---
  <img src="<%= @article.image %>" width="150px">
  <p><%= @article.votes.count %> <%= multiple_votes? %></p> <br>
  <% @article.categories.each do |category| %>