app/views/save_articles/index.html.erb

SELECT "save_articles".* FROM "save_articles" WHERE "save_articles"."user_id" = ? ORDER BY created_at DESC  [["user_id", 3]]
---
<% @user.saved_articles.order("created_at").reverse_order.each do |article_record| %>