app/views/users/show.html.erb

     <img src="<%= article.image %>" width="150px">
     <p><%= article.votes.length %> <%= user_index_votes(article) %></p>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 11]]
SELECT "votes".* FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 11]]