app/helpers/articles_helper.rb

  def multiple_votes?
    return 'vote' if @article.votes.count == 1
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 1]]

  def save_article_show
    return link_to (fa_icon 'heart'), new_session_path, class: 'favorite_highlight' if session[:current_user_id].nil?

    @favorite = @user.saved_articles.where(article_id: @article.id)
    if !@favorite.empty?
---
SELECT "articles".* FROM "articles"

  def add_category(category)
    return link_to category.name, categories_create_path(category_id: category.id, article_id: @article.id), method: :post if category.relate_categories.where(article_id: @article.id).empty? and @article.author_id == session[:current_user_id]
---
SELECT  1 AS one FROM "relate_categories" WHERE "relate_categories"."category_id" = ? AND "relate_categories"."article_id" = ? LIMIT ?  [["category_id", 1], ["article_id", 10], ["LIMIT", 1]]