app/helpers/articles_helper.rb

  def vote
    @vote = Vote.where(user_id: session[:current_user_id], article_id: @article.id)
    if session[:current_user_id].nil?
      link_to (fa_icon "star"), new_session_path, class: 'vote_highlight'
    elsif !@vote.empty?
      link_to (fa_icon "star"), delete_vote_path(id: @vote.first.id, article_id: @article.id), method: :delete, class: 'vote_shadow'
---
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 3], ["article_id", 4], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ?  [["user_id", 3], ["article_id", 2]]
SELECT  1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ? LIMIT ?  [["user_id", 3], ["article_id", 4], ["LIMIT", 1]]

  def multiple_votes?
    return 'vote' if @article.votes.count == 1
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 4]]

  def add_category(category)
    if @article.author_id == session[:current_user_id]
      if category.relate_categories.where(article_id: @article.id).empty?
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  1 AS one FROM "relate_categories" WHERE "relate_categories"."category_id" = ? AND "relate_categories"."article_id" = ? LIMIT ?  [["category_id", 1], ["article_id", 12], ["LIMIT", 1]]

  def save_article_show
    return link_to (fa_icon "heart"), new_session_path, class: 'favorite_highlight' if session[:current_user_id].nil?
    @favorite = @user.saved_articles.where(article_id: @article.id)
    if !@favorite.empty?
      link_to (fa_icon "heart"), save_article_path(id: @favorite.first.id, article_id: @article.id), method: :delete, class: 'favorite_shadow'
---
SELECT "articles".* FROM "articles" ORDER BY created_at