app/helpers/categories_helper.rb

  def latest_category_article_title(category)
    if !category.articles.length.positive?
      'No articles found for this category'
    else
      category.articles.order('created_at').last.title
---
SELECT "articles".* FROM "articles" INNER JOIN "relate_categories" ON "articles"."id" = "relate_categories"."article_id" WHERE "relate_categories"."category_id" = ?  [["category_id", 3]]
SELECT  "articles".* FROM "articles" INNER JOIN "relate_categories" ON "articles"."id" = "relate_categories"."article_id" WHERE "relate_categories"."category_id" = ? ORDER BY created_at DESC LIMIT ?  [["category_id", 2], ["LIMIT", 1]]

  def latest_category_article_image(category)
    return 'https://i.ibb.co/YhBBFvR/anf2.jpg' unless category.articles.length.positive?
---
SELECT  "articles".* FROM "articles" INNER JOIN "relate_categories" ON "articles"."id" = "relate_categories"."article_id" WHERE "relate_categories"."category_id" = ? ORDER BY created_at DESC LIMIT ?  [["category_id", 2], ["LIMIT", 1]]

  def category_article_vote(article)
    @vote = Vote.where(user_id: session[:current_user_id], article_id: article.id)
    if session[:current_user_id].nil?
      link_to (fa_icon 'star'), new_session_path, class: 'vote_highlight'
    elsif !@vote.empty?
---
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["user_id", 3], ["article_id", 10], ["LIMIT", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 11]]