app/helpers/home_helper.rb

SELECT "articles".* FROM "articles" INNER JOIN "relate_categories" ON "articles"."id" = "relate_categories"."article_id" WHERE "relate_categories"."category_id" = ?  [["category_id", 2]]
SELECT  "articles".* FROM "articles" INNER JOIN "relate_categories" ON "articles"."id" = "relate_categories"."article_id" WHERE "relate_categories"."category_id" = ? ORDER BY created_at DESC LIMIT ?  [["category_id", 2], ["LIMIT", 1]]
---
  def index_latest_category_article(category)
    if category.priority <= 2
      if !category.articles.length.positive?
        "No articles found for this category"
      else
        category.articles.order("created_at").last.title

SELECT  "articles".* FROM "articles" INNER JOIN "relate_categories" ON "articles"."id" = "relate_categories"."article_id" WHERE "relate_categories"."category_id" = ? ORDER BY created_at DESC LIMIT ?  [["category_id", 2], ["LIMIT", 1]]
---
  def index_latest_category_article_image(category)
    if category.priority <= 2 and category.articles.length.positive?
      category.articles.order("created_at").last.image