app/helpers/save_articles_helper.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY "articles"."id" ASC LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def find_article(article_record)
    @article.find_by_id(article_record.article_id)