app/helpers/users_helper.rb

  def user_index_votes(article)
    return 'vote' if article.votes.count == 1
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 11]]