app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC
SELECT "categories".* FROM "categories"
---
  def index
    @article = Article.all
    @categories = Category.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "articles" ("author_id", "title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author_id", 1], ["title", "Article to edit"], ["text", "This text doesn't matter"], ["created_at", "2020-07-30 19:37:20.082957"], ["updated_at", "2020-07-30 19:37:20.082957"]]
---
  def create
    @user = User.find_by_id(session[:current_user_id])
    if @user.articles.build(article_params).save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def show
    @article = Article.find_by_id(params[:id])
    @user = User.find_by_id(@article.author_id)
    @category = Category.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Carlos worst article"], ["updated_at", "2020-07-30 19:46:27.577621"], ["id", 8]]
---
  def update
    @article = Article.find_by_id(params[:id])
    if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
DELETE FROM "relate_categories" WHERE "relate_categories"."id" = ?  [["id", 3]]
UPDATE "relate_categories" SET "article_id" = NULL WHERE "relate_categories"."article_id" = ?  [["article_id", 1]]
UPDATE "save_articles" SET "article_id" = NULL WHERE "save_articles"."article_id" = ?  [["article_id", 11]]
SELECT "relate_categories".* FROM "relate_categories" WHERE "relate_categories"."article_id" = ?  [["article_id", 4]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 36]]
SELECT "votes".* FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 11]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 11]]
---
  def destroy
    @article = Article.find_by_id(params[:id])
    @article.relate_categories.destroy_all
    @article.saved_articles.delete_all
    Vote.where(article_id: @article.id).destroy_all
    @article.destroy