app/controllers/categories_controller.rb

  def index
    @categories = Category.all.order('priority')
---
SELECT "categories".* FROM "categories" ORDER BY priority

  def create
    @category = Category.find_by_id(params[:category_id])
    if @category.relate_categories.where(article_id: params[:article_id]).empty?
      if @category.relate_categories.new(article_id: params[:article_id]).save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  1 AS one FROM "relate_categories" WHERE "relate_categories"."category_id" = ? AND "relate_categories"."article_id" = ? LIMIT ?  [["category_id", 3], ["article_id", 1], ["LIMIT", 1]]
INSERT INTO "relate_categories" ("category_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 3], ["article_id", 1], ["created_at", "2020-07-30 15:47:20.299425"], ["updated_at", "2020-07-30 15:47:20.299425"]]

  def show
    @category = Category.find_by_id(params[:id])
    @user = User.find_by_id(session[:current_user_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @category = Category.find_by_id(params[:id])
    return flash.alert = 'Category succesfully removed from your article' if @category.relate_categories.where(article_id: params[:article_id]).destroy_all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "relate_categories" WHERE "relate_categories"."id" = ?  [["id", 6]]
SELECT "relate_categories".* FROM "relate_categories" WHERE "relate_categories"."category_id" = ? AND "relate_categories"."article_id" = ?  [["category_id", 1], ["article_id", 1]]