app/controllers/home_controller.rb

  def index
    @article = Article.all
    @categories = Category.all
---
SELECT "articles".* FROM "articles" ORDER BY created_at
SELECT "categories".* FROM "categories"