app/controllers/save_articles_controller.rb

  def index
    @user = User.find_by_id(session[:current_user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @user = User.find_by_id(session[:current_user_id])
    if !@user.saved_articles.where(article_id: params[:article_id]).empty?
      flash.alert = 'This article is already saved'
    elsif @user.saved_articles.new(article_id: params[:article_id]).save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT  1 AS one FROM "save_articles" WHERE "save_articles"."user_id" = ? AND "save_articles"."article_id" = ? LIMIT ?  [["user_id", 3], ["article_id", 11], ["LIMIT", 1]]
INSERT INTO "save_articles" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["article_id", 11], ["created_at", "2020-07-30 23:31:05.905806"], ["updated_at", "2020-07-30 23:31:05.905806"]]

  def destroy
    @saved_article = SaveArticle.find_by_id(params[:id])
    if @saved_article.destroy
---
SELECT  "save_articles".* FROM "save_articles" WHERE "save_articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "save_articles" WHERE "save_articles"."id" = ?  [["id", 2]]