app/controllers/sessions_controller.rb

  def create
    if @user = User.find_by_name(params[:session][:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Carlos"], ["LIMIT", 1]]