app/controllers/users_controller.rb

  def index
    @current_user = User.find_by_id(session[:current_user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Johann"], ["created_at", "2020-07-28 20:55:36.845954"], ["updated_at", "2020-07-28 20:55:36.845954"]]

  def show
    @user = User.find_by_id(session[:current_user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]