app/controllers/votes_controller.rb

  def create
    @article = Article.find_by_id(params[:article_id])
    if session[:current_user_id].nil?
      redirect_to new_session_path
    elsif !Vote.where(user_id: session[:current_user_id], article_id: @article.id).empty?
      flash.alert = 'Vote recorded'
      redirect
    elsif @article.votes.new(user_id: session[:current_user_id]).save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ? LIMIT ?  [["user_id", 9], ["article_id", 1], ["LIMIT", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."article_id" = ?  [["user_id", 2], ["article_id", 3]]
INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 8], ["article_id", 10], ["created_at", "2020-07-30 21:12:23.072370"], ["updated_at", "2020-07-30 21:12:23.072370"]]

  def destroy
    if Vote.find_by_id(params[:id]).destroy
---
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 18]]
SELECT  "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]