app/views/categories/show.html.erb

  <h1><%= @category.name %></h1>
  <% @category.articles.order("created_at").reverse_order.each do |article| %>
    <h2><%= link_to article.title, article_path(id: article.id) %></h2>
    <h3><%= User.find_by_id(article.author_id).name %></h3>
    <img src="<%= article.image %>" alt="" width="150px">
    <p><%= article.votes.count %> <%= category_votes(article) %></p>
---
SELECT "articles".* FROM "articles" INNER JOIN "relate_categories" ON "articles"."id" = "relate_categories"."article_id" WHERE "relate_categories"."category_id" = ? ORDER BY created_at DESC  [["category_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."article_id" = ?  [["article_id", 10]]